Docs: Update benchmarks, mermaids and examples.
